{"head":{"author":"mike3run","comments":true,"date":"2015-09-22T14:00:55.000Z","layout":"Post","link":"http://www.miguel.click/blog/2015/09/22/5-extensiones-para-google-chrome-que-tienes-que-instalar/","slug":"5-extensiones-para-google-chrome-que-tienes-que-instalar","title":"5 Extensiones para Google Chrome que Tienes que Instalar","wordpress_id":11334,"categories":["Article"],"description":"Utilizo Google Chrome todos los días tanto para explorar como para trabajar y hacer que sucedan cosas. Por eso tener una serie de…"},"body":"<p>Utilizo <a href=\"http://www.google.com/chrome/browser/desktop\">Google Chrome</a> todos los días tanto para explorar como para trabajar y hacer que sucedan cosas. Por eso tener una serie de extensiones útiles es un <em>MUST</em> para mi. Acá una lista con mis 5 Extensiones Favoritas.</p>\n<h2 id=\"01-clear-downloads\"><a href=\"#01-clear-downloads\" class=\"phenomic-HeadingAnchor\">#</a>01 <a href=\"https://chrome.google.com/webstore/detail/clear-downloads/bknoejjhcfmakcibhifepfkegpjdnadk\">Clear Downloads</a></h2>\n<p>Esta pequeña herramienta hace un trabajo y lo hace muy bien: borra la barra de descargas cada 10 segundos si no tienes una descarga activa. Excesivamente útil si tienes una MacBook Air o similar donde cada pequeño centímentro de pantalla cuenta.</p>\n<h2 id=\"02-adblock-plus\"><a href=\"#02-adblock-plus\" class=\"phenomic-HeadingAnchor\">#</a>02 <a href=\"https://adblockplus.org/\">AdBlock Plus</a></h2>\n<p>A veces olvido mencionar esta extensión ya que para mi es algo tan natural como para los normales es instalar Facebook en su celular nuevo. Básicamente lo que hace esta extensión es quitarte la publicidad de todos lados incluyendo en videos de Youtube y Twitch. Hay quienes se oponen a usarla por motivos morales y demás pero la realidad es que se ahorra pila al mismo tiempo que se navega más rápido por tener esta extensión activa.</p>\n<h2 id=\"03-hover-cards\"><a href=\"#03-hover-cards\" class=\"phenomic-HeadingAnchor\">#</a>03 <a href=\"http://hovercards.com/\">Hover Cards</a></h2>\n<p>Esta extensión es bastante nueva creo que tendrá una o dos semanas de vida como mucho, la conocí en <a href=\"http://www.producthunt.com/\"><strong>Product Hunt</strong></a> mi página de inicio donde encuentro todo lo más nuevo de tecnología <em>SIEMPRE</em>.</p>\n<p>En fin, lo que hace esta extensión es evitar tener que hacer click en todos lados pues con que pases el mouse encima de un link como de Youtube, Instagram, Twitter, Imgur, etc. La realidad es que para esta extensión vale la pena mucho más usarla que platicarla.</p>\n<h2 id=\"04-panda\"><a href=\"#04-panda\" class=\"phenomic-HeadingAnchor\">#</a>04 <a href=\"http://usepanda.com/\">Panda</a></h2>\n<p>Hell yeah mi extensión favorita del momento. Con Panda tus pestañas nuevas se vuelven un centro de comando para recibir toda la información e inspiración para cosas como Front-End Development, Back-End Development, Startups, Tecnología y Geekiness posible en un solo lugar. Muy muy genial nuevamente debes usarla para entenderla.</p>\n<h2 id=\"05-detox\"><a href=\"#05-detox\" class=\"phenomic-HeadingAnchor\">#</a>05 <a href=\"http://usedetox.com/\">Detox</a></h2>\n<p>Si estás harto de entrar a Facebook y no ver otra cosa que videos de Banaz, Wereverwero, videos de abuso animal para denunciarlo o en general noticias tristes instala Detox para refrescar tu mente con Feeds directos de <strong>Panda</strong> pero se ponen en tu timeline de Facebook para leer con mucho flow y comodidad.</p>\n<h2 id=\"conclusiones\"><a href=\"#conclusiones\" class=\"phenomic-HeadingAnchor\">#</a>Conclusiones</h2>\n<p>Espero les haya gustado esta pequeña lista de Extensiones que ocupo en mi día a día aún existen más que uso y muchas más que no conocemos aún pero lo bonito de internet es que la información está ahí esperando que la encuentres si buscas bien.</p>\n<p>Cualquier comentario estaré encantado de leerlo y contestarlo.</p>\n<p><a href=\"mailto:hola@miguel.click\">hola@miguel.click</a></p>\n","__filename":"posts/chrome-extensions.md","__url":"/posts/chrome-extensions/","__resourceUrl":"/posts/chrome-extensions/index.html","__dataUrl":"/posts/chrome-extensions/index.html.2b685892748dd456f2641b4df8709ac5.json"}