{"head":{"author":"mike3run","comments":true,"date":"2015-09-28T12:23:15.000Z","layout":"Post","link":"http://www.miguel.click/blog/2015/09/28/herramientas-para-startups/","slug":"herramientas-para-startups","title":"Herramientas para Startups","wordpress_id":11344,"categories":["Article"],"description":"Herramientas para Startups En esta ocasión quiero escribir acerca de las herramientas que ocupo en GeekBytes para hacer mi vida más fácil y…"},"body":"<h1 id=\"herramientas-para-startups\"><a href=\"#herramientas-para-startups\" class=\"phenomic-HeadingAnchor\">#</a>Herramientas para Startups</h1>\n<p>En esta ocasión quiero escribir acerca de las herramientas que ocupo en GeekBytes para hacer mi vida más fácil y que siento pueden hacer tu vida mejor también.</p>\n<h2 id=\"1-bittorrent-sync--gratis\"><a href=\"#1-bittorrent-sync--gratis\" class=\"phenomic-HeadingAnchor\">#</a><a href=\"https://www.getsync.com/\">1 Bittorrent Sync – Gratis</a></h2>\n<p>Bittorrent Sync es una chulada de cosa, básicamente es Dropbox pero que funciona de manera local y privada. Osea, una nube sin la nube. Hay cliente para Windows, Mac, iOS, Android y Linux. Otra carácterística cool que tiene es que puedes configurarle un <a href=\"https://en.wikipedia.org/wiki/Network-attached_storage\"><strong>disco duro conectado a la red (NAS)</strong></a> de tal manera que crees una verdadera nube privada.</p>\n<p>En cuanto al espacio solo estás limitado por tu capacidad de disco duro así que a darle duro. En cuanto al tema de Android está genial ya que con Sync puedes transferir un respaldo de todas tus fotos de manera inalámbrica y muy fácil a tu computadora o disco duro. Es gratis para usar pero un pago único de $40 USD desbloquea la capacidad de sincronización selectiva. Un must si tienes una MacBook Air por ejemplo.</p>\n<h2 id=\"2-slack--gratis\"><a href=\"#2-slack--gratis\" class=\"phenomic-HeadingAnchor\">#</a><a href=\"https://slack.com/\">2 Slack – Gratis</a></h2>\n<p>Todos necesitamos comunicarnos para lograr las cosas y normalmente la comunicación entre equipos es algo asqueroso en el formato tradicional de e-mail o en el formato <em>novedoso</em> de grupos de Whatsapp.</p>\n<p>Slack es una combinación de ambos pero mucho mucho más poderoso ya que te permite crear salones de chat tanto para el equipo completo como salas privadas dependiendo de cada proyecto o directamente inbox a personas individuales. Tiene capacidad de enviar archivos adjuntos y de conectar robots o hacer el tuyo con su API sencilla de entender.</p>\n<p><a href=\"http://www.miguel.click/blog/2015/09/09/integrando-todoist-ifttt-y-slack-miideaes/\"><strong>Hice un post sobre como lo usamos nosotros hace un tiempo</strong>.</a></p>\n<h2 id=\"3-todoist--gratis\"><a href=\"#3-todoist--gratis\" class=\"phenomic-HeadingAnchor\">#</a><a href=\"https://todoist.com/\">3 Todoist – Gratis</a></h2>\n<p>Todoist es un gestor de tareas que se ve bonito, funciona en todos lados y sirve para el trabajo en equipo. Creo que no hay mucho que decir más que pruébalo para entender como es que es tan cool. Piensa en Clear pero más bonito y funcional en más plataformas pero colaborativo 😍.</p>\n<h2 id=\"4-focus--20-usd\"><a href=\"#4-focus--20-usd\" class=\"phenomic-HeadingAnchor\">#</a><a href=\"https://heyfocus.com/\">4 Focus – $20 USD</a></h2>\n<p>Focus es una pequeña herramienta que vive en tu barra de estado de la Mac. Y cumple una sola función: que te concentres.</p>\n<p><img src=\"https://i1.wp.com/s3.amazonaws.com/f.cl.ly/items/1v0R152R2n0a1B042K1z/Focus.png?ssl=1\" alt=\"Un ejemplo de lo que pasa si quiero entrar a Facebook con Focus activado\"></p>\n<p>Muy bueno pues puedes configurarlo por intervalos de tiempo pre-establecidos y eso puede servir como una especie de Timer Pomodoro para la concentración. Tiene un modo estricto donde aunque lo elimines no se puede evitar la concentración durante ese tiempo. Úsalo con cuidado.</p>\n<h2 id=\"5-cloudapp--gratis\"><a href=\"#5-cloudapp--gratis\" class=\"phenomic-HeadingAnchor\">#</a><a href=\"https://www.getcloudapp.com/\">5 CloudApp – Gratis</a></h2>\n<p>Cuando se trata de compartir archivos con el resto de la humanidad ocupo Cloud. Lo que hace esta pequeña app que igual vive en mi barra de estado de la Mac es que puedes compartir archivos de manera muy fácil solo arrastrándolo al ícono de la nube. Me encantó porque puedes configurarle tu propio dominio. Por ejemplo:</p>\n<p><a href=\"http://cloud.miguel.click/3S3G0x3D1G3O\">http://cloud.miguel.click/3S3G0x3D1G3O</a></p>\n<p>Ese enlace los lleva a un libro excelente que les quiero compartir. Pero noten como la liga empieza con cloud.miguel.click detalles pequeños pero que van contando poco a poco 😉.</p>\n<h2 id=\"6-ia-writer--20-usd\"><a href=\"#6-ia-writer--20-usd\" class=\"phenomic-HeadingAnchor\">#</a><a href=\"https://ia.net/writer\">6 iA Writer – $20 USD</a></h2>\n<p>iA Writer en la herramienta que ocupo para escribir en formato <em>Markdown</em> tanto para este blog como para situaciones de organizar ideas y estructurarlas en GeekyBytes.</p>\n<p>Con markdown es muy fácil darle formato al texto de manera cómoda y sin tener que despegar las manos del teclado. El tiempo de transición de no saberlo usar a amarlo es como de 20 minutos.</p>\n<p><a href=\"https://daringfireball.net/projects/markdown/basics\">El creador de Markdown tiene una guía muy fácil de leer en su blog</a>.</p>\n<p><img src=\"https://i1.wp.com/s3.amazonaws.com/f.cl.ly/items/2d0p443Z0G2h2Z0R1A46/iA.png?ssl=1\" alt=\"Markdown + iA Writer en todo su esplendor\"></p>\n<p>Otro plus que me da iA Writer es que revisa mi sintaxis en cuanto a uso de verbos, adjetivos, sustantivos, adverbios y conjunciones, para escribir bonito vaya.</p>\n<h2 id=\"7-mindnode--10usd\"><a href=\"#7-mindnode--10usd\" class=\"phenomic-HeadingAnchor\">#</a><a href=\"https://mindnode.com/\">7 MindNode – $10USD</a></h2>\n<p>Otra herramienta que ocupo mucho desde la prepa son los mapas mentales mismos que aprendí al leer <a href=\"http://www.amazon.com.mx/El-Libro-Los-Mapas-Mentales/dp/8479531460/ref=sr_1_1?ie=UTF8&#x26;qid=1443440910&#x26;sr=8-1&#x26;keywords=el+libro+de+los+mapas+mentales\">“El libro de los mapas mentales” de Tony Buzan</a> libro que sea dicho de paso mi mamá sigue a media lectura pero eso sí, en su mesa de leer de noche desde hace como 7 años 😂.</p>\n<p>El punto es que solía ser fan de <a href=\"http://thinkbuzan.com/products/imindmap/\">la app oficial de mapas mentales de Tony Buzan</a> pues porque es del creator y te salen así como en el libro. Pero el capitalismo de este señor es imparable 😰 ya que con un precio mínimo de $100 USD con un estricto control de activaciones y además que se actualiza de manera anual pero pagado pos no se puede. Entonces al ser herramientas para startups hay que pensar <em>pobreza</em> claro la primera opción sería hacerlo a mano pero fuchi <strong>we have technology!</strong></p>\n<p>Por eso llega MindNode, $10 USD actualizado eternamente, iCloud y usable en todas tus computadoras.</p>\n<p><img src=\"https://i2.wp.com/gif.co/sLOR.gif\" alt=\"Yo ahora mismo\"></p>\n<h2 id=\"8-numbers--gratis\"><a href=\"#8-numbers--gratis\" class=\"phenomic-HeadingAnchor\">#</a><a href=\"http://www.apple.com/mx/mac/numbers/\">8 Numbers – Gratis</a></h2>\n<p>A veces es necesario usar hojas de cálculo (aka Excel) pero tenemos el problema de que Excel es asqueroso y cuesta.</p>\n<p>Meet Numbers básicamente Excel pero bonito y no tan listo, pero suficiente para mi, seguramente suficiente para ti también.</p>\n<h2 id=\"9-keynote--gratis\"><a href=\"#9-keynote--gratis\" class=\"phenomic-HeadingAnchor\">#</a><a href=\"http://www.apple.com/mx/mac/keynote/\">9 Keynote – Gratis</a></h2>\n<p>Lo mismo para las presentaciones solo que a diferencia de Numbers, Keynote es verdaderamente superior en todo aspecto a PowerPoint. Let’s get that money!</p>\n<h2 id=\"10-gifs-for-mac--gratis\"><a href=\"#10-gifs-for-mac--gratis\" class=\"phenomic-HeadingAnchor\">#</a><a href=\"https://www.riffsy.com/Mac\">10 GIFs for Mac – Gratis</a></h2>\n<p><img src=\"https://i0.wp.com/www.riffsy.com/static/images/riffsy/splash/popup.gif?ssl=1\" alt=\"Este gif lo dice todo\"></p>\n<p>Para nada esencial y productivo pero 100% divertido y útil para bloguear y para chats en slack o telegram entre compañeros de equipo y amigos.</p>\n","__filename":"posts/herramientas-para-startups.md","__url":"/posts/herramientas-para-startups/","__resourceUrl":"/posts/herramientas-para-startups/index.html","__dataUrl":"/posts/herramientas-para-startups/index.html.c0ac21b21f4425f4cc6a9012d49e9d54.json"}