{"head":{"author":"mike3run","comments":true,"date":"2015-09-09T17:00:44.000Z","layout":"Post","link":"http://www.miguel.click/blog/2015/09/09/integrando-todoist-ifttt-y-slack-miideaes/","slug":"integrando-todoist-ifttt-y-slack-miideaes","title":"Integrando ToDoIst, IFTTT y Slack - #MiIdeaEs","wordpress_id":11330,"categories":["Article"],"description":"Pues ayer vinieron personas de Apple al Tec de Monterrey en Puebla a dar varios talleres y conferencias. Primordialmente enfocados a que…"},"body":"<p>Pues ayer vinieron personas de Apple al Tec de Monterrey en Puebla a dar varios talleres y conferencias. Primordialmente enfocados a que las personas instalen y usen Apps en general. De nada sirve tener un iPhone 6 Plus de 128 GB si lo vas a usar para Facebook, Whatsapp y Candy Crush.</p>\n<p>Chequen este gráfico donde nos revela que la gente no instala apps nuevas a su celular.<a href=\"http://qz.com/253618/most-smartphone-users-download-zero-apps-per-month/\"><img src=\"https://i2.wp.com/www.miguel.click/wp-content/uploads/2015/09/Nadiebajanada.png?resize=1026%252C516\" title=\"Gráfico de Quartz\"></a></p>\n<p>Quizá instalen las de cajón cuando se lo compran pero hasta ahí queda, por eso esfuerzos por titanes como Apple de educar a las personas en el sentido de que tienen realmente mucho poder en sus bolsillos y deberían ser más curiosos para encontrar soluciones muy buenas a problemas cotidianos. Vaya, la tecnología en general.</p>\n<h2 id=\"miideaes\"><a href=\"#miideaes\" class=\"phenomic-HeadingAnchor\">#</a>#MiIdeaEs</h2>\n<p>Por lo mismo y para incentivar el pensamiento creativo Apple como todo ente misterioso y Omnisciente que es hizo un concurso en Twitter usando el hashtag #MiIdeaEs donde los estudiantes y participantes en general pueden contribuir ideas sobre como usar apps para resolver problemas que puedan surgir en la vida estudiantil. Al no estar limitados por un número de entradas por persona pues decidí publicar varias cosas que efectivamente hago en mi día a día para compartirlas con el mundo esperando ser leído. Uno de esos tuits fue este:</p>\n<p><a href=\"https://twitter.com/mpalau/status/641320564985098240\">https://twitter.com/mpalau/status/641320564985098240</a></p>\n<p>Y pues hasta ahí todo bien continué con mi día normal me fui a dormir y demás cuando hoy desperté con una respuesta muy cool vía Twitter de parte de ToDoIst en si mismo:</p>\n<blockquote>\n<p><a href=\"https://twitter.com/mpalau\">@mpalau</a> es un planazo! ¿Quieres contarnoslo por email Miguel? Puede ser un buen ejemplo para otros usuarios. Escribe a daniel@doist.io 🙂</p>\n<p>— Todoist Español (@todoist_espanol) <a href=\"https://twitter.com/todoist_espanol/status/641545951518281729\">September 9, 2015</a></p>\n</blockquote>\n<p>Así que por eso estoy escribiendo este post para compartir de manera detallada el flujo de trabajo que ocupamos en <a href=\"http://www.geekybytes.mx/\">GeekyBytes</a> en nuestro día a día:</p>\n<h3 id=\"problema\"><a href=\"#problema\" class=\"phenomic-HeadingAnchor\">#</a>Problema</h3>\n<p>Quiero una manera de estar en contacto con todos los miembros de mi equipo y donde todos estemos pendientes de las tareas que hay que cumplir. Nos podamos comunicar asignar tareas y marcar como completadas.</p>\n<p><em>Oh, y que sea inter-sistemas (iOS, Android, Windows, Mac).</em></p>\n<h3 id=\"requisitos\"><a href=\"#requisitos\" class=\"phenomic-HeadingAnchor\">#</a>Requisitos</h3>\n<ul>\n<li><a href=\"https://es.todoist.com/\">ToDoIst</a>: Una app para gestión de tareas y trabajo en equipo. Funciona en todos lados y además está bonita. 👻</li>\n</ul>\n<p><img src=\"https://i2.wp.com/www.miguel.click/wp-content/uploads/2015/09/TodoIst.png\"></p>\n<ul>\n<li><a href=\"https://ifttt.com/\">IFTTT</a>: If This, Then That. App para automatización de tu vida digital. Ej. Si va a llover cambiar mis luces a azul tenue para avisarme.</li>\n</ul>\n<p><img src=\"https://i1.wp.com/www.miguel.click/wp-content/uploads/2015/09/1_IFTTTEjemplo.png\"></p>\n<ul>\n<li><a href=\"https://slack.com/\">Slack</a>: Una combinación entre chat grupal, inbox privado, correo y robots. (Sip, robots)<img src=\"https://i0.wp.com/www.miguel.click/wp-content/uploads/2015/09/ElRobot.png?resize=744%252C415\" title=\"Amo a El Robot tiene mucha sabiduría.\"></li>\n<li>Una computadora o un smartphone.</li>\n<li>Actitud de ahorrar tiempo.</li>\n</ul>\n<h3 id=\"setup\"><a href=\"#setup\" class=\"phenomic-HeadingAnchor\">#</a>Setup</h3>\n<ol>\n<li>Crea tus cuentas en cada servicio. En el caso de Slack si no hay equipo créalo tu e invita a los demás miembros.</li>\n<li>En Todoist crea un Proyecto nuevo para ser usado en equipo. No olvides de agregar a los miembros del equipo.</li>\n<li>Ingresa a IFTTT o IF by IFTTT en tu smartphone y activa el canal de TodoIst.</li>\n<li>Regresa al apartado de Canales y activa el canal de Slack.</li>\n<li>Ahora si vamos a unir todo. Entra a la sección de recetas y crea una receta que se active cuando se cree una tarea nueva en el canal de equipo de Todoist y lo que va a hacer es postear en Slack en el chat grupal general (o donde quieras realmente) la tarea que hay que hacer.</li>\n<li>Se feliz y automatiza tu vida!</li>\n</ol>\n<p><img src=\"https://i2.wp.com/www.miguel.click/wp-content/uploads/2015/09/LaReceta.png?resize=1024%252C709\" title=\"Acá tienen mi plantilla de uso\"></p>\n<p>Acá les muestro como se ve mi receta corriendo en la Mac:</p>\n<p><img src=\"https://i0.wp.com/www.miguel.click/wp-content/uploads/2015/09/Elejemploenuso.png?resize=1112%252C812\"></p>\n<h2 id=\"conclusiones\"><a href=\"#conclusiones\" class=\"phenomic-HeadingAnchor\">#</a>Conclusiones</h2>\n<p>Realmente hay muchas cosas que se pueden hacer con la tecnología y eso sin tener que saber programar. Mientras exista la curiosidad seguirán habiendo ideas innovadoras para resolver todo tipo de problemas, incluso los que ni siquiera hemos imaginado aún.</p>\n<p>Espero les haya gustado este post y cualquier comentario con gusto lo contestaré.</p>\n","__filename":"posts/integrando-todoist-ifttt-y-slack.md","__url":"/posts/integrando-todoist-ifttt-y-slack/","__resourceUrl":"/posts/integrando-todoist-ifttt-y-slack/index.html","__dataUrl":"/posts/integrando-todoist-ifttt-y-slack/index.html.480d27273f48511494232ac568bf850e.json"}